
posetrack_keypoint_info =  {
    "keypoints": {
        0: "鼻子",
        1: "頸部",
        2: "頭頂",
        3: "左肩",
        4: "右肩",
        5: "左手肘",
        6: "右手肘",
        7: "左手腕",
        8: "右手腕",
        9: "左髋",
        10: "右髋",
        11: "左膝",
        12: "右膝",
        13: "左腳踝",
        14: "右腳踝",
        15: "頭部",
        16: "臀部",
        # 3: "鼻子",
        # 4: "鼻子",
        # 5: "左肩",
        # 6: "右肩",
        # 7: "左手肘",
        # 8: "右手肘",
        # 9: "左手腕",
        # 10: "右手腕",
        # 11: "左髋",
        # 12: "右髋",
        # 13: "左膝",
        # 14: "右膝",
        # 15: "左腳踝",
        # 16: "右腳踝",
        # 17: "頭部",
        # 18: "臀部",

    },
    "skeleton_links": [
        [0, 1], [0, 2], [0,15], # 頭
        [3, 1], [4, 1],[16, 1],#軀幹
        #軀幹
        [3, 5], [5, 7],                 #左手
        [4, 6], [6, 8],                #右手
        [16, 9], [9, 11], [11, 13],   #左腿
        [16, 10], [10, 12], [12, 14],   #右腿
    ],
    "left_points_indices": [[3, 1], [3, 5], [5, 7],[15, 9], [9, 11], [11, 13]],  # Indices of left hand, leg, and foot keypoints
    "right_points_indices": [[4, 1], [4, 6], [6, 8],  [15, 10], [10, 12], [12, 14]]  # Indices of right hand, leg, and foot keypoints
}